Kim-J-Smith/STM32-SimpleButton/kim_stm32_hal_button.h
/**
 * @file            kim_stm32_hal_button.h
 * 
 * @author          Kim-J-Smith
 * 
 * @brief           Kim Library to offer a template for button [STM32 HAL]
 * 
 * @version         0.1.3 ( 0009L )
 *                  (match with stm32fxxx_hal.h or stm32hxxx_hal.h)
 * 
 * @date            2025-08-26
 * 
 * @attention       Copyright (c) 2025 Kim-J-Smith.
 *                  All rights reserved.
 * 
 * @copyright       This project complies with the MIT License.
 *                  Refer to the LICENCE in root for more details.
 */
# include <stdint.h>

#ifndef     KIM_STM32_HAL_BUTTON_H
#define     KIM_STM32_HAL_BUTTON_H      0009L

/* ============ Users can customize these by themselves ============ */

/***** @headerfile Select one of the header files given below as needed *****/
# include "stm32f1xx_hal.h"
// # include "stm32f2xx_hal.h"
// # include "stm32f3xx_hal.h"
// # include "stm32f4xx_hal.h"
// # include "stm32h4xx_hal.h"
// # include "stm32h7xx_hal.h"

/***** time config *****/
/* one tick(one interrupt = 1ms) */
#define KIM_BUTTON_SYSTICK_ONE_TICK                 (SystemCoreClock / (1000UL / HAL_GetTickFreq()))
/* calculate the tick with the time */
#define KIM_BUTTON_TIME_MS(_xx_ms)                  (1 * (_xx_ms))

#define KIM_BUTTON_PUSH_DELAY_TIME                  KIM_BUTTON_TIME_MS(40)          /* 40 ms */
#define KIM_BUTTON_DOUBLE_PUSH_MAX_TIME             KIM_BUTTON_TIME_MS(300)         /* 300 ms */
#define KIM_BUTTON_LONG_PUSH_MIN_TIME               KIM_BUTTON_TIME_MS(1000)        /* 1000 ms */
#define KIM_BUTTON_RELEASE_DELAY_TIME               KIM_BUTTON_TIME_MS(40)          /* 40 ms */
#define KIM_BUTTON_COOL_DOWN_TIME                   KIM_BUTTON_TIME_MS(0)           /* 0 ms */

/* If this macro is 1, then the TIME above cannot be configured separately for each button */
#define KIM_BUTTON_ONLY_USE_DEFAULT_TIME            0

/***** NVIC Priority config *****/
#define KIM_BUTTON_NVIC_SYSTICK_PreemptionPriority  TICK_INT_PRIORITY
#define KIM_BUTTON_NVIC_SYSTICK_SubPriority         0   /* this macro is not in use */

#define KIM_BUTTON_NVIC_EXTI_PreemptionPriority     0
#define KIM_BUTTON_NVIC_EXTI_SubPriority            0

/***** If you use STM32CubeMX to generate code, define follow macro as @c 1 ,   *****
 ***** otherwise define follow macro as @c 0 .                                  *****/
#define KIM_BUTTON_STM32CUBEMX_GENERATE_SYSTICK     0
#define KIM_BUTTON_STM32CUBEMX_GENERATE_EXTI        0
#define KIM_BUTTON_STM32CUBEMX_GENERATE_NVIC        0

/***** Name Prefix *****/
/** If you change this macro, you need to use `new_prefix + Init_ + button_name()`      **
 ** to initialize the button, and use `new_prefix + button_name` struct to use method.  **
 **                                                                                     **
 ** @example #define KIM_BUTTON_NAME_PREFIX         KEY_                                **
 ** KIM_BUTTON__REGISTER(..., ..., ..., THE_NAME)                                       **
 ** Then I need to use `KEY_Init_THE_NAME()` to initialize the button, and use          **
 ** `KEY_THE_NAME.method_asynchronous_handler(..., ..., ...)` and                       **
 ** `KEY_THE_NAME.method_interrupt_handler()`                                           **/
#define KIM_BUTTON_NAME_PREFIX                      Kim_Button_

/***** Critical Zone *****/
/* define follow macro when multi-thread */
#define KIM_BUTTON_CRITICAL_ZONE_BEGIN()            do {/* __disable_irq(); */} while(0U)
#define KIM_BUTTON_CRITICAL_ZONE_END()              do {/* __enable_irq(); */} while(0U)

/* define follow macro any time */
#define KIM_BUTTON_ALWAYS_CRITICAL_ZONE_BEGIN()     do { __disable_irq(); } while(0U)
#define KIM_BUTTON_ALWAYS_CRITICAL_ZONE_END()       do { __enable_irq(); } while(0U)

/***** Macro for debug mode *****/
#define KIM_BUTTON_USE_DEBUG_MODE                   0   /* 1 --> use debug mode */
#define KIM_BUTTON_DEBUG_ERROR_HOOK()               /* ... can be your function ... */

/***** Macro for noinline state machine(Kim_Button_PrivateUse_AsynchronousHandler) function *****/
#define KIM_BUTTON_NO_INLINE_STATE_MACHINE          0

/***** Macro to enable different long push time *****/
#define KIM_BUTTON_ENABLE_DIFFERENT_TIME_LONG_PUSH  0

/***** Macro to enable button combination *****/
#define KIM_BUTTON_ENABLE_BUTTON_COMBINATION        0

/* ====================== Customization END ======================== */



#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus enum & struct */

/* The enum is for State Machine. */
enum Kim_Button_State {
    Kim_Button_State_Wait_For_Interrupt = 0,

    Kim_Button_State_Push_Delay,

    Kim_Button_State_Wait_For_End,

    Kim_Button_State_Wait_For_Double,

    Kim_Button_State_Single_Push,

    Kim_Button_State_Double_Push,

    Kim_Button_State_Release_Delay,

    Kim_Button_State_Cool_Down,

#if KIM_BUTTON_ENABLE_BUTTON_COMBINATION != 0

    Kim_Button_State_Combination_Push,

    Kim_Button_State_Combination_WaitForEnd,

    Kim_Button_State_Combination_Release,

#endif /* KIM_BUTTON_ENABLE_BUTTON_COMBINATION */
};

#ifndef ENUM_BITFIELD
    /* Used in struct bit field */
    #define ENUM_BITFIELD(type)     unsigned int 
#endif /* ENUM_BITFIELD */

typedef void (*Kim_Button_ShortPushCallBack_t)(void);

#if KIM_BUTTON_ENABLE_DIFFERENT_TIME_LONG_PUSH == 0
    typedef void (*Kim_Button_LongPushCallBack_t)(void);
#else
    typedef void (*Kim_Button_LongPushCallBack_t)(uint32_t long_push_tick);
#endif /* different long push time */

typedef void (*Kim_Button_DoublePushCallBack_t)(void);

#if KIM_BUTTON_ENABLE_BUTTON_COMBINATION != 0
    typedef void (*Kim_Button_CombinationCallBack_t)(void);
#endif /* button combination */

/* This struct is for status and behaviour of each button. */
struct Kim_Button_TypeDef {
    /** @p [private] This member variable will be changed only in interrupt service routine. */
    volatile uint32_t                               private_time_stamp_interrupt;

    /** @p [private] This member variable will be changed only in while loop. */
    uint32_t                                        private_time_stamp_loop;

    /** @b [public] Method for asynchronous handler. Use this method in while loop. */
    void (* method_asynchronous_handler) (
        Kim_Button_ShortPushCallBack_t short_push_callback,
        Kim_Button_LongPushCallBack_t long_push_callback,
        Kim_Button_DoublePushCallBack_t double_push_callback
    );

