Kim-J-Smith/STM32-SimpleButton/kim_stm32_hal_button.h
    /** @b [public] Method for handler in interrupt (EXTI). Use this method in IT service routine. */
    void (* method_interrupt_handler) (void);

#if KIM_BUTTON_ENABLE_BUTTON_COMBINATION != 0

    /** @b [public] Record the combination [before] button pointer. */
    struct Kim_Button_TypeDef* public_comb_before_button;

    /** @b [public] Record the combination button callback function.
     * (This callback function will be called when button-[This] is released 
     * and button-[before] is in the pressed state.) */
    Kim_Button_CombinationCallBack_t public_comb_callback;

#endif /* button combination */

#if KIM_BUTTON_ONLY_USE_DEFAULT_TIME == 0

    /** @b [public] This member variable is used to record the long-push time. */
    uint16_t                                        public_long_push_min_time;

    /** @b [public] This member variable is used to record the cool-down time. */
    uint16_t                                        public_cool_down_time;

    /** @b [public] This member variable is used to record the double push max time. */
    uint16_t                                        public_double_push_max_time;

#endif /* KIM_BUTTON_ONLY_USE_DEFAULT_TIME */

    /** @p [private] This member variable is used to record the state of each button. */
    volatile ENUM_BITFIELD (enum Kim_Button_State)  private_state : 4;

    /** @p [private] This member variable is used to record how many times you push the button(0/1/2). */
    uint8_t                                         private_push_time : 3;

    /** @p [private] This member variable is used to record the state of initialization. */
    uint8_t                                         private_is_init : 1;
};

#ifdef __cplusplus
}
#endif /* __cplusplus enum & struct */


/* ======= [private use] Some private-use functions [static] ======= */

/* Macro for judge the EXTI Trigger */
#define KIM_BUTTON_JUDGE_TRIGGER(EXTI_TRIGGER_X)        \
    (( (EXTI_TRIGGER_X == EXTI_TRIGGER_RISING_FALLING)  \
    || (EXTI_TRIGGER_X == EXTI_TRIGGER_NONE) ) ? -1 : 1)

/* Macro for judge GPIOx_BASE and GPIO_PIN_X */
#if defined(GPIOF_BASE)
 #define KIM_BUTTON_JUDGE_GPIO_PIN_F(GPIOx_BASE)    ((GPIOx_BASE) == GPIOF_BASE)
#else
 #define KIM_BUTTON_JUDGE_GPIO_PIN_F(GPIOx_BASE)    (0)
#endif /* KIM_BUTTON_JUDGE_GPIO_PIN_F */

#if defined(GPIOG_BASE)
 #define KIM_BUTTON_JUDGE_GPIO_PIN_G(GPIOx_BASE)    ((GPIOx_BASE) == GPIOG_BASE)
#else
 #define KIM_BUTTON_JUDGE_GPIO_PIN_G(GPIOx_BASE)    (0)
#endif /* KIM_BUTTON_JUDGE_GPIO_PIN_G */

#if defined(GPIOH_BASE)
 #define KIM_BUTTON_JUDGE_GPIO_PIN_H(GPIOx_BASE)    ((GPIOx_BASE) == GPIOH_BASE)
#else
 #define KIM_BUTTON_JUDGE_GPIO_PIN_H(GPIOx_BASE)    (0)
#endif /* KIM_BUTTON_JUDGE_GPIO_PIN_H */

#if defined(GPIOI_BASE)
 #define KIM_BUTTON_JUDGE_GPIO_PIN_I(GPIOx_BASE)    ((GPIOx_BASE) == GPIOI_BASE)
#else
 #define KIM_BUTTON_JUDGE_GPIO_PIN_I(GPIOx_BASE)    (0)
#endif /* KIM_BUTTON_JUDGE_GPIO_PIN_I */

#if defined(GPIOJ_BASE)
 #define KIM_BUTTON_JUDGE_GPIO_PIN_J(GPIOx_BASE)    ((GPIOx_BASE) == GPIOJ_BASE)
#else
 #define KIM_BUTTON_JUDGE_GPIO_PIN_J(GPIOx_BASE)    (0)
#endif /* KIM_BUTTON_JUDGE_GPIO_PIN_J */

#if defined(GPIOK_BASE)
 #define KIM_BUTTON_JUDGE_GPIO_PIN_K(GPIOx_BASE)    ((GPIOx_BASE) == GPIOK_BASE)
#else
 #define KIM_BUTTON_JUDGE_GPIO_PIN_K(GPIOx_BASE)    (0)
#endif /* KIM_BUTTON_JUDGE_GPIO_PIN_K */

#define KIM_BUTTON_JUDGE_GPIO_PIN(GPIOx_BASE, PIN)      \
    ( ((                                                \
        (GPIOx_BASE) == GPIOA_BASE ||                   \
        (GPIOx_BASE) == GPIOB_BASE ||                   \
        (GPIOx_BASE) == GPIOC_BASE ||                   \
        (GPIOx_BASE) == GPIOD_BASE ||                   \
        (GPIOx_BASE) == GPIOE_BASE ||                   \
        KIM_BUTTON_JUDGE_GPIO_PIN_F(GPIOx_BASE) ||      \
        KIM_BUTTON_JUDGE_GPIO_PIN_G(GPIOx_BASE) ||      \
        KIM_BUTTON_JUDGE_GPIO_PIN_H(GPIOx_BASE) ||      \
        KIM_BUTTON_JUDGE_GPIO_PIN_I(GPIOx_BASE) ||      \
        KIM_BUTTON_JUDGE_GPIO_PIN_J(GPIOx_BASE) ||      \
        KIM_BUTTON_JUDGE_GPIO_PIN_K(GPIOx_BASE)         \
    ) && (                                              \
        (PIN) == GPIO_PIN_0 || (PIN) == GPIO_PIN_1 ||   \
        (PIN) == GPIO_PIN_2 || (PIN) == GPIO_PIN_3 ||   \
        (PIN) == GPIO_PIN_4 || (PIN) == GPIO_PIN_5 ||   \
        (PIN) == GPIO_PIN_6 || (PIN) == GPIO_PIN_7 ||   \
        (PIN) == GPIO_PIN_8 || (PIN) == GPIO_PIN_9 ||   \
        (PIN) == GPIO_PIN_10 || (PIN) == GPIO_PIN_11 || \
        (PIN) == GPIO_PIN_12 || (PIN) == GPIO_PIN_13 || \
        (PIN) == GPIO_PIN_14 || (PIN) == GPIO_PIN_15    \
    )) ? 1 : -1 )

/* Macro for using functin with security */
#define KIM_BUTTON_SAFE_CALLBACK(_callback)         \
    do { if((_callback) != ((void*)0)) { _callback(); } } while(0U)

/* Macro for C API */
#ifdef __cplusplus
    #define KIM_BUTTON_C_API    extern "C" 
#else 
    #define KIM_BUTTON_C_API
#endif /* __cplusplus */

/* Macro for Force Inline of private-use functions */
#if defined(__GNUC__)
    #define KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE    static inline __attribute__((always_inline)) 
#elif defined(__CC_ARM)
    #define KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE    static __forceinline 
#else
    #define KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE    static inline
#endif /* FORCE_INLINE */

/* Macro for suggest inline of private-use functions */
#if !(defined(DEBUG) || defined(_DEBUG))
 #if KIM_BUTTON_NO_INLINE_STATE_MACHINE == 0
    #define KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE      static inline
 #else
    #define KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE      static
 #endif /* KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE */
#else
 #if defined(__GNUC__)
    #define KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE      static __attribute__((noinline)) \
                                                        __attribute__((optimize("O1")))
 #elif defined(__CC_ARM)
    #define KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE      static __attribute__((noinline))
 #else
    #define KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE      static 
 #endif /* KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE */
#endif /* KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE */

/* Macro for debug */
#if KIM_BUTTON_USE_DEBUG_MODE != 0
    #define DEBUG
#endif

