Kim-J-Smith/STM32-SimpleButton/kim_stm32_hal_button.h
/* Macro to connect macro */
#define KIM_BUTTON_CONNECT(_a, _b)          KIM_BUTTON_CONNECT_1(_a, _b)
#define KIM_BUTTON_CONNECT_1(_a, _b)        KIM_BUTTON_CONNECT_2(_a, _b)
#define KIM_BUTTON_CONNECT_2(_a, _b)        _a ## _b

#define KIM_BUTTON_CONNECT3(_a, _b, _c)     KIM_BUTTON_CONNECT3_1(_a, _b, _c)
#define KIM_BUTTON_CONNECT3_1(_a, _b, _c)   KIM_BUTTON_CONNECT3_2(_a, _b, _c)
#define KIM_BUTTON_CONNECT3_2(_a, _b, _c)   _a ## _b ## _c

/** 
 * @p               [private-use]
 * @brief           Init the Button, including the GPIO, EXTI and NVIC.
 * @param[inout]    self - pointer to self struct.
 * @param[in]       gpiox_base - can be GPIOA_BASE / GPIOB_BASE / GPIOC_BASE / ...
 * @param[in]       gpio_pin_x - can be GPIO_PIN_0 / GPIO_PIN_1 / ... / GPIO_PIN_15.
 * @param[in]       exti_trigger_x - can be EXTI_TRIGGER_RISING or EXTI_TRIGGER_FALLING.
 * @param[in]       method_asynchronous_handler - function pointer to the method named 
 *                  `Kim_Button_Asynchronous_Handler_ ## __name` [static].
 * @param[in]       method_interrupt_handler - function pointer to the method named 
 *                  `Kim_Button_Handler_During_IT_ ## __name` [static].
 * @return          None
 */
KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_InitButton(
    struct Kim_Button_TypeDef* const self,
    const uint32_t gpiox_base,
    const uint16_t gpio_pin_x,
    const uint32_t exti_trigger_x,
    void (* method_asynchronous_handler) (
        Kim_Button_ShortPushCallBack_t short_push_callback,
        Kim_Button_LongPushCallBack_t long_push_callback,
        Kim_Button_DoublePushCallBack_t double_push_callback
    ),
    void (* method_interrupt_handler) (void)
)
{
    /* Initialize only once */
    if(self->private_is_init != 0) {
#if defined(DEBUG) || defined(_DEBUG)
        KIM_BUTTON_DEBUG_ERROR_HOOK();
        while(1) {}
#endif /* DEBUG */
        return;
    } else {
        self->private_is_init = 1;
    }

    /* Initialize the member variables */
    self->private_push_time = 0;
    self->private_time_stamp_loop = 0;

    /* volatile variables */
    KIM_BUTTON_CRITICAL_ZONE_BEGIN();
    self->private_state = Kim_Button_State_Wait_For_Interrupt;
    self->private_time_stamp_interrupt = 0;
    KIM_BUTTON_CRITICAL_ZONE_END();

    /* public variables */
#if KIM_BUTTON_ONLY_USE_DEFAULT_TIME == 0
    self->public_long_push_min_time = KIM_BUTTON_LONG_PUSH_MIN_TIME;
    self->public_cool_down_time = KIM_BUTTON_COOL_DOWN_TIME;
    self->public_double_push_max_time = KIM_BUTTON_DOUBLE_PUSH_MAX_TIME;
#endif /* KIM_BUTTON_ONLY_USE_DEFAULT_TIME */

    /* Initialize the public method */
    self->method_asynchronous_handler = method_asynchronous_handler;
    self->method_interrupt_handler = method_interrupt_handler;

    /* combination button */
#if KIM_BUTTON_ENABLE_BUTTON_COMBINATION != 0

    self->public_comb_before_button = 0;
    self->public_comb_callback = 0;

#endif /* combination button */

    /* SysTick configure */
#if (KIM_BUTTON_STM32CUBEMX_GENERATE_SYSTICK == 0)
    uint32_t check_error = 0U;

    check_error = HAL_SYSTICK_Config(KIM_BUTTON_SYSTICK_ONE_TICK);
    HAL_NVIC_SetPriority(SysTick_IRQn,
        KIM_BUTTON_NVIC_SYSTICK_PreemptionPriority,
        0UL /* Make sure it can promptly preempt other low-priority interrupts */
    ); 
    /* SysTick is within the core, don't need to be enabled(NVIC_Enable). */
    uwTickPrio = KIM_BUTTON_NVIC_SYSTICK_PreemptionPriority;

    /* error handler */
 #if defined(DEBUG) || defined(_DEBUG)
    if(check_error != 0) {
        KIM_BUTTON_DEBUG_ERROR_HOOK();
        while(1) {}
    }
 #else
    (void)check_error;
 #endif /* DEBUG */
#endif /*KIM_BUTTON_STM32CUBEMX_GENERATE_SYSTICK*/


#if (KIM_BUTTON_STM32CUBEMX_GENERATE_EXTI == 0)

    /* Initialize the AFIO Clock(F1xx) or SYSCFG Clock */
#if defined(__HAL_RCC_AFIO_CLK_ENABLE)
    __HAL_RCC_AFIO_CLK_ENABLE();
#elif defined(__HAL_RCC_SYSCFG_CLK_ENABLE)
    __HAL_RCC_SYSCFG_CLK_ENABLE();
#else
 #warning Cannot find macro for AFIO or SYSCFG !
#endif /* AFIO or SYSCFG */

    /* Initialize the GPIOx Clock */
    switch (gpiox_base) {
    case GPIOA_BASE:
        __HAL_RCC_GPIOA_CLK_ENABLE();
        break;
    case GPIOB_BASE:
        __HAL_RCC_GPIOB_CLK_ENABLE();
        break;
    case GPIOC_BASE:
        __HAL_RCC_GPIOC_CLK_ENABLE();
        break;
    case GPIOD_BASE:
        __HAL_RCC_GPIOD_CLK_ENABLE();
        break;
    case GPIOE_BASE:
        __HAL_RCC_GPIOE_CLK_ENABLE();
        break;
    default:
        /* ... error handler ... */
#if defined(DEBUG) || defined(_DEBUG)
        KIM_BUTTON_DEBUG_ERROR_HOOK();
        while(1) {}
#endif /* DEBUG */
        break;
    }

    /* Configure the GPIOx */
    GPIO_InitTypeDef gpio_config;
    gpio_config.Mode = (exti_trigger_x == EXTI_TRIGGER_RISING)
        ? (GPIO_MODE_IT_RISING) : (GPIO_MODE_IT_FALLING);
    gpio_config.Pin = (uint32_t) gpio_pin_x;
    gpio_config.Pull = (exti_trigger_x == EXTI_TRIGGER_RISING)
        ? (GPIO_PULLDOWN) : (GPIO_PULLUP);
    gpio_config.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init((GPIO_TypeDef*)gpiox_base, &gpio_config);
#else
    (void)gpiox_base;
    (void)exti_trigger_x;
#endif /* KIM_BUTTON_STM32CUBEMX_GENERATE_EXTI */


#if (KIM_BUTTON_STM32CUBEMX_GENERATE_NVIC == 0)
    /* Initialize the EXTI */
    IRQn_Type the_exti_IRQ;
    switch (gpio_pin_x) {
    case GPIO_PIN_0:
        the_exti_IRQ = EXTI0_IRQn;
        break;
    case GPIO_PIN_1:
        the_exti_IRQ = EXTI1_IRQn;
        break;
    case GPIO_PIN_2:
        the_exti_IRQ = EXTI2_IRQn;
        break;
    case GPIO_PIN_3:
        the_exti_IRQ = EXTI3_IRQn;
        break;
    case GPIO_PIN_4:
        the_exti_IRQ = EXTI4_IRQn;
        break;
    case GPIO_PIN_5:
        the_exti_IRQ = EXTI9_5_IRQn;
        break;
    case GPIO_PIN_6:
        the_exti_IRQ = EXTI9_5_IRQn;
        break;
    case GPIO_PIN_7:
        the_exti_IRQ = EXTI9_5_IRQn;
        break;
    case GPIO_PIN_8:
        the_exti_IRQ = EXTI9_5_IRQn;
        break;
    case GPIO_PIN_9:
        the_exti_IRQ = EXTI9_5_IRQn;
        break;
    case GPIO_PIN_10:
        the_exti_IRQ = EXTI15_10_IRQn;
        break;
    case GPIO_PIN_11:
        the_exti_IRQ = EXTI15_10_IRQn;
        break;
    case GPIO_PIN_12:
        the_exti_IRQ = EXTI15_10_IRQn;
        break;
    case GPIO_PIN_13:
        the_exti_IRQ = EXTI15_10_IRQn;
        break;
    case GPIO_PIN_14:
        the_exti_IRQ = EXTI15_10_IRQn;
        break;
    case GPIO_PIN_15:
        the_exti_IRQ = EXTI15_10_IRQn;
        break;
    default:
        /* ... error handler ... */
        the_exti_IRQ = EXTI0_IRQn;
#if defined(DEBUG) || defined(_DEBUG)
        KIM_BUTTON_DEBUG_ERROR_HOOK();
        while(1) {}
#endif /* DEBUG */
        break;
    }
    HAL_NVIC_SetPriority(
        the_exti_IRQ, 
        KIM_BUTTON_NVIC_EXTI_PreemptionPriority,
        KIM_BUTTON_NVIC_EXTI_SubPriority
    );
    HAL_NVIC_EnableIRQ(the_exti_IRQ);
#else
    (void)gpio_pin_x;
#endif /* KIM_BUTTON_STM32CUBEMX_GENERATE_NVIC */
}

/**
 * @p               [private-use]
 * @brief           Change the status of each button when during the EXTI interrupt
 *                  service routine.
 * @param[inout]    self - pointer to self struct.
 * @return          None
 */
KIM_BUTTON_PRIVATE_FUNC_FORCE_INLINE void Kim_Button_PrivateUse_ITHandler(
    struct Kim_Button_TypeDef* const self
)
{
    if( ((enum Kim_Button_State)self->private_state) == Kim_Button_State_Wait_For_Double
        || ((enum Kim_Button_State)self->private_state) == Kim_Button_State_Wait_For_Interrupt) 
    {
        self->private_time_stamp_interrupt = HAL_GetTick();
        self->private_state = Kim_Button_State_Push_Delay;
    }
}

/**
 * @p               [private-use]
 * @brief           Asynchronously call the callback func by the status of each button.
 * @param[inout]    self - pointer to self struct.
 * @param[in]       gpiox_base - can be GPIOA_BASE / GPIOB_BASE / GPIOC_BASE / ...
 * @param[in]       gpio_pin_x - can be GPIO_PIN_0 / GPIO_PIN_1 / ... / GPIO_PIN_15.
 * @param[in]       exti_trigger_x - can be EXTI_TRIGGER_RISING or EXTI_TRIGGER_FALLING.
 * @param[in]       short_push_callback - callback function for short push.
 * @param[in]       long_push_callback - callback function for long push.
 * @param[in]       double_push_callback - callback function for double push.
 * @return          None
 */
KIM_BUTTON_PRIVATE_FUNC_SUGGEST_INLINE void Kim_Button_PrivateUse_AsynchronousHandler(
    struct Kim_Button_TypeDef* const self,
    const uint32_t gpiox_base,
    const uint16_t gpio_pin_x,
    const uint8_t Normal_Bit_Val,
    Kim_Button_ShortPushCallBack_t short_push_callback,
    Kim_Button_LongPushCallBack_t long_push_callback,
    Kim_Button_DoublePushCallBack_t double_push_callback
)
{
    /* Critical Zone Begin */
    KIM_BUTTON_CRITICAL_ZONE_BEGIN();

    switch ((enum Kim_Button_State)self->private_state) {
    case Kim_Button_State_Wait_For_Interrupt:
        break;
    case Kim_Button_State_Push_Delay:
        if(HAL_GetTick() - self->private_time_stamp_interrupt 
            > KIM_BUTTON_PUSH_DELAY_TIME)
        {
            /* Check the GPIO Pin again */
            if(HAL_GPIO_ReadPin((GPIO_TypeDef*)gpiox_base, gpio_pin_x) == Normal_Bit_Val)
            {
                self->private_state = Kim_Button_State_Wait_For_Interrupt;
            } else {
                self->private_state = Kim_Button_State_Wait_For_End;
            }
        }
        break;
    case Kim_Button_State_Wait_For_End:
        if(HAL_GPIO_ReadPin((GPIO_TypeDef*)gpiox_base, gpio_pin_x) == Normal_Bit_Val)
        {
            self->private_state = Kim_Button_State_Release_Delay;
        }
        break;
    case Kim_Button_State_Double_Push:
        KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */

        KIM_BUTTON_SAFE_CALLBACK(double_push_callback);
        
        KIM_BUTTON_CRITICAL_ZONE_BEGIN(); /* Critical Zone Begin */
        self->private_push_time = 0;
        self->private_time_stamp_loop = HAL_GetTick();
        self->private_state = Kim_Button_State_Cool_Down;
        break;
    case Kim_Button_State_Wait_For_Double:
        KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */

        KIM_BUTTON_ALWAYS_CRITICAL_ZONE_BEGIN(); /* DANGEROUS critical zone begin */
        if(HAL_GetTick() - self->private_time_stamp_loop
#if KIM_BUTTON_ONLY_USE_DEFAULT_TIME == 0
            > (uint32_t)self->public_double_push_max_time
#else
            > KIM_BUTTON_DOUBLE_PUSH_MAX_TIME
#endif /* KIM_BUTTON_ONLY_USE_DEFAULT_TIME */
        )
        {
            self->private_state = Kim_Button_State_Single_Push;
        }
        KIM_BUTTON_ALWAYS_CRITICAL_ZONE_END(); /* DANGEROUS critical zone end */

        KIM_BUTTON_CRITICAL_ZONE_BEGIN(); /* Critical Zone Begin */
        break;
    case Kim_Button_State_Single_Push:
        if(HAL_GetTick() - self->private_time_stamp_interrupt
#if KIM_BUTTON_ONLY_USE_DEFAULT_TIME == 0
            > (uint32_t)self->public_long_push_min_time
#else
            > KIM_BUTTON_LONG_PUSH_MIN_TIME
#endif /* KIM_BUTTON_ONLY_USE_DEFAULT_TIME */
        )
        { 
#if KIM_BUTTON_ENABLE_DIFFERENT_TIME_LONG_PUSH == 0
            KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */
            KIM_BUTTON_SAFE_CALLBACK(long_push_callback);
#else
            uint32_t long_push_tick = HAL_GetTick() - self->private_time_stamp_interrupt;
            KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */
            if(long_push_callback != ((void*)0)) {
                long_push_callback(long_push_tick); 
            }
#endif /* different long push time */
        } else {
            KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */
            KIM_BUTTON_SAFE_CALLBACK(short_push_callback);
        }
        
        KIM_BUTTON_CRITICAL_ZONE_BEGIN(); /* Critical Zone Begin */
        self->private_push_time = 0;
        self->private_time_stamp_loop = HAL_GetTick();
        self->private_state = Kim_Button_State_Cool_Down;
        break;
    case Kim_Button_State_Release_Delay:
        if(HAL_GetTick() - self->private_time_stamp_loop 
            > KIM_BUTTON_RELEASE_DELAY_TIME)
        {
            if(HAL_GPIO_ReadPin((GPIO_TypeDef*)gpiox_base, gpio_pin_x) == Normal_Bit_Val)
            {
                self->private_push_time ++;
                self->private_time_stamp_loop = HAL_GetTick();
                self->private_state = (self->private_push_time == 1)
                    ? Kim_Button_State_Wait_For_Double : Kim_Button_State_Double_Push;

