Kim-J-Smith/STM32-SimpleButton/kim_stm32_hal_button.h
#if KIM_BUTTON_ENABLE_BUTTON_COMBINATION != 0

                if(self->public_comb_before_button == 0 || self->public_comb_callback == 0)
                {
                    break;
                }
                /* check button-[before] */
                if(self->public_comb_before_button->private_state != Kim_Button_State_Combination_WaitForEnd)
                {
                    if(self->public_comb_before_button->private_state != Kim_Button_State_Wait_For_End) {
                        break;
                    } else {
                        self->public_comb_before_button->private_state = Kim_Button_State_Combination_WaitForEnd;
                    }
                }
                self->private_state = Kim_Button_State_Combination_Push;
                    
#endif /* combination button */

            } else {
                self->private_state = Kim_Button_State_Wait_For_End;
            }
        }
        break;
    case Kim_Button_State_Cool_Down:
        if(HAL_GetTick() - self->private_time_stamp_loop 
#if KIM_BUTTON_ONLY_USE_DEFAULT_TIME == 0
            > (uint32_t)self->public_cool_down_time
#else
            > KIM_BUTTON_COOL_DOWN_TIME
#endif /* KIM_BUTTON_ONLY_USE_DEFAULT_TIME */
        )
        {
            self->private_state = Kim_Button_State_Wait_For_Interrupt;
        }
        break;

#if KIM_BUTTON_ENABLE_BUTTON_COMBINATION != 0

    case Kim_Button_State_Combination_Push:
        KIM_BUTTON_CRITICAL_ZONE_END(); /* Critical Zone End */

        KIM_BUTTON_SAFE_CALLBACK(self->public_comb_callback);

        KIM_BUTTON_CRITICAL_ZONE_BEGIN(); /* Critical Zone Begin */
        self->private_push_time = 0;
        self->private_time_stamp_loop = HAL_GetTick();
        self->private_state = Kim_Button_State_Cool_Down;
        break;

    case Kim_Button_State_Combination_WaitForEnd:
        if(HAL_GPIO_ReadPin((GPIO_TypeDef*)gpiox_base, gpio_pin_x) == Normal_Bit_Val)
        {
            self->private_state = Kim_Button_State_Combination_Release;
        }
        break;

    case Kim_Button_State_Combination_Release:
        if(HAL_GetTick() - self->private_time_stamp_loop 
            > KIM_BUTTON_RELEASE_DELAY_TIME)
        {
            /* check again */
            if(HAL_GPIO_ReadPin((GPIO_TypeDef*)gpiox_base, gpio_pin_x) == Normal_Bit_Val)
            {
                self->private_push_time = 0;
                self->private_time_stamp_loop = HAL_GetTick();
                self->private_state = Kim_Button_State_Cool_Down;
            } else {
                self->private_state = Kim_Button_State_Combination_WaitForEnd;
            }         
        }
        break;

#endif /* button combination */

    default:
        /* ... error handler ... */
#if defined(DEBUG) || defined(_DEBUG)
        KIM_BUTTON_DEBUG_ERROR_HOOK();
        while(1) {}
#endif /* DEBUG */
        break;
    }

    /* Critical Zone End */
    KIM_BUTTON_CRITICAL_ZONE_END(); 
}

/* ================ Private-use functions END ====================== */



/**
 * @def         KIM_BUTTON__REGISTER
 * @brief       This is a template for generating code of button.
 *              It will generate 3 functions, including:
 *      @arg `Kim_Button_Init_ ## __name` [extern "C" public-use].
 *      @arg `Kim_Button_Asynchronous_Handler_ ## __name` [static private-use].
 *      @arg `Kim_Button_Handler_During_IT_ ## __name` [static private-use].
 * @param       GPIOx_BASE - can be GPIOA_BASE / GPIOB_BASE / GPIOC_BASE / ...
 * @param       GPIO_PIN_X - can be GPIO_PIN_0 / GPIO_PIN_1 / ... / GPIO_PIN_15.
 * @param       EXTI_TRIGGER_X - can be EXTI_TRIGGER_RISING or EXTI_TRIGGER_FALLING.
 * @param       __name - the name of your button. can be any string.
 * @attention   @p Error(array[-1]) will occur:
 *              1. If EXTI_TRIGGER_X is set as EXTI_TRIGGER_RISING_FALLING or EXTI_TRIGGER_NONE.
 *              2. If GPIOx_BASE is invalid.
 *              3. If GPIO_PIN_X is invalid.
 */
#define KIM_BUTTON__REGISTER(GPIOx_BASE, GPIO_PIN_X, EXTI_TRIGGER_X, __name)    \
    struct Kim_Button_TypeDef KIM_BUTTON_CONNECT(KIM_BUTTON_NAME_PREFIX,__name);\
                                                                                \
    static void                                                                 \
    KIM_BUTTON_CONNECT(Kim_Button_Asynchronous_Handler_, __name)(               \
        Kim_Button_ShortPushCallBack_t short_push_callback,                     \
        Kim_Button_LongPushCallBack_t long_push_callback,                       \
        Kim_Button_DoublePushCallBack_t double_push_callback                    \
    )                                                                           \
    {                                                                           \
        static const uint8_t Normal_Bit_Val =                                   \
            (EXTI_TRIGGER_X == EXTI_TRIGGER_RISING) ? 0 : 1;                    \
                                                                                \
        Kim_Button_PrivateUse_AsynchronousHandler(                              \
            &(KIM_BUTTON_CONNECT(KIM_BUTTON_NAME_PREFIX, __name)),              \
            GPIOx_BASE,                                                         \
            GPIO_PIN_X,                                                         \
            Normal_Bit_Val,                                                     \
            short_push_callback,                                                \
            long_push_callback,                                                 \
            double_push_callback                                                \
        );                                                                      \
    }                                                                           \
                                                                                \
    static void                                                                 \
    KIM_BUTTON_CONNECT(Kim_Button_Handler_During_IT_, __name)(void)             \
    {                                                                           \
        Kim_Button_PrivateUse_ITHandler(                                        \
            &(KIM_BUTTON_CONNECT(KIM_BUTTON_NAME_PREFIX, __name))               \
        );                                                                      \
    }                                                                           \
                                                                                \
    KIM_BUTTON_C_API void                                                       \
    KIM_BUTTON_CONNECT3(KIM_BUTTON_NAME_PREFIX, Init_, __name) (void)           \
    {                                                                           \
        /* Assert the EXTI Trigger (use array[-1] to raise error) */            \
        static const char                                                       \
            assert_exti_trg[KIM_BUTTON_JUDGE_TRIGGER(EXTI_TRIGGER_X)] = {0};    \
        (void)assert_exti_trg;                                                  \
                                                                                \
        /* Assert the GPIO_BASE and PIN (use array[-1] to raise error) */       \
        static const char                                                       \
            assert_gpio_pin[                                                    \
                KIM_BUTTON_JUDGE_GPIO_PIN(GPIOx_BASE, GPIO_PIN_X)               \
            ] = {0};                                                            \
        (void)assert_gpio_pin;                                                  \
                                                                                \
        Kim_Button_PrivateUse_InitButton(                                       \
            &(KIM_BUTTON_CONNECT(KIM_BUTTON_NAME_PREFIX, __name)),              \
            GPIOx_BASE,                                                         \
            GPIO_PIN_X,                                                         \
            EXTI_TRIGGER_X,                                                     \
            &(Kim_Button_Asynchronous_Handler_ ## __name),                      \
            &(Kim_Button_Handler_During_IT_ ## __name)                          \
        );                                                                      \
    }
    
/**
 * @def         KIM_BUTTON__DECLARE
 * @brief       You can use `KIM_BUTTON__REGISTER` to generate code in one file.
 *              And then, you need to use `KIM_BUTTON__DECLARE` to declare them in
 *              another file before you want to use them.
 * @param       __name - the name of your button. remain the same as it in `KIM_BUTTON__REGISTER`.
 */
#define KIM_BUTTON__DECLARE(__name)                                                         \
    extern struct Kim_Button_TypeDef KIM_BUTTON_CONNECT(KIM_BUTTON_NAME_PREFIX, __name);    \
    KIM_BUTTON_C_API void KIM_BUTTON_CONNECT3(KIM_BUTTON_NAME_PREFIX, Init_, __name)(void);


#endif /* KIM_STM32_HAL_BUTTON_H */
